function processFolders(folder_travel, folder_area, wheel_choices, ...
                                                       sys_struct)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Детальное описание функции:
%   processFolders - принимает на вход название папок проездов, названия
%   определенных участков, структуру содержащую передаточные функции систе-
%   мы, а также коллекцию содержащию выбор пользователя какие направления
%   перераспределения энрегии нужно учесть, функция ничего не возвращает.
%
% Входные аргументы:
% - folder_travel - название папок проездов.
% - folder_area - название папок определенных участков.
% - wheel_choices - выбор пользователя направления учета перераспределения
%   энергии. 
% - sys_struct - структура содержащая передаточные функции системы.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% Код функции начинается здесь

    % Получаем путь к основному скрипту
    main_path = fileparts(mfilename('fullpath'));

    % Формируем путь к папке с данными
    data_path = fullfile(main_path, '..', 'data');
  
    % Количество обрабатываемых объектов
    num_sections = sum(cellfun(@numel, folder_area));
    
    fprintf('Запуск обхода каталогов, в сумме их %d штук.\n', ...
        num_sections);

    % Внешний цикл проходится по индекса массива с папками folder_travel
    for i = 1:numel(folder_travel)

        % Путь к проездам (folder_travel)
        travel_path = fullfile(data_path, folder_travel{i});
        fprintf('Обход каталогов внутри: %s...\n', folder_travel{i});

        for j = 1:numel(folder_area{i})
            
            % Путь к сырым данным
            raw_path = fullfile(travel_path, folder_area{i}{j}, 'raw');
            
            % Выбор того что нужно учесть
            wheel_choice = wheel_choices{i}{j};

            % Запуст функции корректировки исходных данных
            energyRedistribution(raw_path, main_path, ...
                              wheel_choice, sys_struct)

        end

    end
    

    fprintf('Данные успешно записанны в постоянную память.\n');
    %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Код функции заканчивается здесь
end